_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АналогиОбъектовВНБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_АналогиОбъектовВНБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеВНБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРаспределенияОбъемов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СхемаРаспределенияОбъемов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШифрОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШифрАналога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНормативногоСборникаОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНормативногоСборникаАналога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_ДополнительныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_ДополнительныеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СтатусыФормированияНормативов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СтатусыФормированияНормативов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_НормативныеСборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_НормативныеСборники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНормативнойРасценки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБруттоТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНеттоТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Определитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_Определители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНормативногоСборника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыНормативныхСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ДатыБазисныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СметноНормативнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыФормированияНормативов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныНормативныхСборников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегиональнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_СметноНормативныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ТерриториальныеРайоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрямыеЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяЗарплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭксплуатацияМашинИМеханизмов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВТомЧислеЗарплатаМашинистов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакладныеРасходыСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СметнаяПрибыльСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗатратыТрудаРабочих</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РесурсыНормативныхСборников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРесурса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_ТипыМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_АналогиОбъектовВНБ/Forms/ФормаСопоставления/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") Тогда
		Элементы.НормативныеСборники.ТекущаяСтрока=Параметры.Ссылка;
	КонецЕсли;
	СсылкаТекущего=Неопределено;
	//	МассивДляРазворота=Новый Массив;
	Зп=РегистрыСВедений.СМ_ДополнительныеНастройки.СоздатьМенеджерЗаписи();
	Зп.ИдентификаторНастройки="ДеревоНормативов";
	Зп.Прочитать();
	ДЗ=ДанныеФормыВЗначение(ДеревоНормативов, Тип("ДеревоЗначений"));
	ДЗ=Зп.Настройки.Получить();
	Если ДЗ<>Неопределено Тогда
		ЗначениеВДанныеФормы(ДЗ,ДеревоНормативов);
	КонецЕсли;
	КоличествоСопоставленных();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура НормативныеСборникиПриАктивизацииСтроки(Элемент)
	
	
	ПодключитьОбработчикОжидания("ЗаполнитьПриАктивизации",1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриАктивизации()
	
	Если  Элементы.НормативныеСборники.ТекущиеДанные<>Неопределено Тогда
		
		Если Элементы.НормативныеСборники.ТекущиеДанные.ЭтоГруппа=Ложь Тогда
			Если СсылкаТекущего<>Элементы.НормативныеСборники.ТекущиеДанные.Ссылка Тогда
				СсылкаТекущего=Элементы.НормативныеСборники.ТекущиеДанные.Ссылка;
				СопоставленоТекущему(Элементы.НормативныеСборники.ТекущиеДанные.КодНормативнойРасценки, Элементы.НормативныеСборники.ТекущиеДанные.ТипНормативногоСборника);
				СхемаРаспределения=Элементы.НормативныеСборники.ТекущиеДанные.СхемаРаспределенияОбъемов;
				Элементы.СхемаРаспределения.Доступность=НЕ ЗначениеЗаполнено(СхемаРаспределения);
				Элементы.РедактироватьСхему.Доступность= Не Элементы.СхемаРаспределения.Доступность;
				УстановитьУсловноеОформление();	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСоответствие(Команда)
	
	Если Элементы.ДеревоНормативов.ТекущиеДанные<>Неопределено Тогда
		ТекущийНомер=Элементы.ДеревоНормативов.ТекущиеДанные.Номер;
	КонецЕсли;
	

	Если Не ЗначениеЗаполнено(СхемаРаспределения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать схему распределения объемов");
		Возврат;
	КонецЕсли;
	
	МассивОбъектов=Новый Массив;
	Для Каждого Эл Из   Элементы.НормативныеСборники.ВыделенныеСтроки Цикл
		МассивОбъектов.Добавить(Эл);
	КонецЦикла;
	
	МассивНорм=Новый Массив;
	Для Каждого Эл Из   Элементы.ДеревоНормативов.ВыделенныеСтроки Цикл
		МассивНорм.Добавить(Эл);
	КонецЦикла;
	
	МассивДляРазворота=Новый Массив;
	СохранитьВыборНаСервере(МассивОбъектов,МассивНорм,,МассивДляРазворота);
	Элементы.НормативныеСборники.Обновить();
	
	УстановитьУсловноеОформление();
	
	Сч=МассивДляРазворота.Количество()-1;
	РазвернутьНС(ДеревоНормативов,Сч,МассивДляРазворота);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствиеВДереве(Команда)
	
	Если  СметнаяКомпонента = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сметная компонента не загружена");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СхемаРаспределения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать схему распределения объемов");
		Возврат;
	КонецЕсли;
	
	Если Элементы.ДеревоНормативов.ТекущиеДанные<>Неопределено Тогда
		ТекущийНомер=Элементы.ДеревоНормативов.ТекущиеДанные.Номер;
	КонецЕсли;
	
	МассивОбъектов=Новый Массив;
	Для Каждого Эл Из   Элементы.НормативныеСборники.ВыделенныеСтроки Цикл
		МассивОбъектов.Добавить(Эл);
	КонецЦикла;
	
	МассивНорм=Новый Массив;
	Для Каждого Эл Из   Элементы.ДеревоНормативов.ВыделенныеСтроки Цикл
		МассивНорм.Добавить(Эл);
	КонецЦикла;
	
	МассивДляРазворота=Новый Массив;
	СохранитьВыборНаСервере(МассивОбъектов,МассивНорм,Истина,МассивДляРазворота);
	Элементы.НормативныеСборники.Обновить();
	
	УстановитьУсловноеОформление();
	Сч=МассивДляРазворота.Количество()-1;
	РазвернутьНС(ДеревоНормативов,Сч,МассивДляРазворота);
	
КонецПроцедуры


&НаСервере

Процедура ЗаполнитьСписокОбъектов(МассивОбъектов)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СМ_НормативныеСборники.КодНормативнойРасценки КАК ШифрОбъекта,
	                    |	СМ_НормативныеСборники.ТипНормативногоСборника КАК ТипНормативногоСборникаОбъекта
	                    |ИЗ
	                    |	Справочник.СМ_НормативныеСборники КАК СМ_НормативныеСборники
	                    |ГДЕ
	                    |	НЕ СМ_НормативныеСборники.ЭтоГруппа
	                    |	И НЕ СМ_НормативныеСборники.ПометкаУдаления
	                    |	И СМ_НормативныеСборники.Ссылка В(&Ссылка)
	                    |	И ВЫБОР
	                    |			КОГДА &ИспользоватьСтатусы
	                    |				ТОГДА СМ_НормативныеСборники.Статус = ЗНАЧЕНИЕ(Перечисление.СМ_СтатусыФормированияНормативов.Утвержден)
	                    |			ИНАЧЕ ИСТИНА
	                    |		КОНЕЦ");
	Запрос.УстановитьПараметр("Ссылка",МассивОбъектов);
	Запрос.УстановитьПараметр("ИспользоватьСтатусы",ПолучитьФункциональнуюОпцию("СМ_ИспользоватьСтатусыНормативов"));
	СписокОбъектов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

&НаСервере

Процедура СохранитьВыборНаСервере(МассивОбъектов,МассивНорм,Удалить=Ложь,МассивДляРазворота)
	
	ЗаполнитьСписокОбъектов(МассивОбъектов);
	
	Ответственный=Пользователи.ТекущийПользователь();
	Дт=ТекущаяДата();
	
	Для Каждого Эл Из СписокОбъектов Цикл
		Для Каждого ТекНорма Из МассивНорм Цикл
			
			ОбъектДляЗаполнения=ДеревоНормативов.НайтиПоИдентификатору(ТекНорма);
			
			Запись=РегистрыСведений.СМ_АналогиОбъектовВНБ.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись,Эл);
			Запись.ШифрАналога=ОбъектДляЗаполнения.Код;
			Запись.ТипНормативногоСборникаАналога=ОбъектДляЗаполнения.ТипНормативногоСборника;
			Запись.СметноНормативнаяБаза =ОбъектДляЗаполнения.СметноНормативнаяБаза;
			Запись.НаименованиеВНБ=ОбъектДляЗаполнения.Наименование;
			Запись.ЕдиницаИзмерения=ОбъектДляЗаполнения.ЕдиницаИзмерения;
			Запись.СхемаРаспределенияОбъемов=СхемаРаспределения;
			Запись.Ответственный=Ответственный;
			Запись.Дата=Дт;
			Если Удалить Тогда
				Запись.Прочитать();
				Запись.Удалить();
			Иначе
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	КоличествоСопоставленных(МассивДляРазворота);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСопоставленные(Команда)
	Элементы.НормативныеСборникиСкрытьСопоставленные.Пометка=Не Элементы.НормативныеСборникиСкрытьСопоставленные.Пометка;
	Элементы.НормативныеСборникиСкрытьНесопоставленные.Пометка=Ложь;
	Если Элементы.НормативныеСборникиСкрытьСопоставленные.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НормативныеСборники, "Сопоставлено",Ложь,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НормативныеСборники, "КоличествоСопоставленных", ,,,Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НормативныеСборники, "Сопоставлено", ,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНесопоставленные(Команда)
	Элементы.НормативныеСборникиСкрытьНесопоставленные.Пометка=Не Элементы.НормативныеСборникиСкрытьНесопоставленные.Пометка;
	Элементы.НормативныеСборникиСкрытьСопоставленные.Пометка=Ложь;
	Если Элементы.НормативныеСборникиСкрытьНесопоставленные.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НормативныеСборники, "КоличествоСопоставленных",0,ВидСравненияКомпоновкиДанных.Больше,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НормативныеСборники, "Сопоставлено", ,,,Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НормативныеСборники, "КоличествоСопоставленных", ,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ОбновитьДерево(Команда)
	
ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры),НСтр("ru = 'Загрузка займет продолжительное время. Продолжить?';"), РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ВключитьЗагрузку();
	Нормы		= СметнаяКомпонента.ПолучитьСписокСборников("", );
	Прогресс=1;
	МассивСекций=Новый Массив;
	Состояние("Загрузка нормативов...", Прогресс, "",) ;
	СоздатьСборники(Нормы);
	ПолучитьМассивСекций(МассивСекций);
	Состояние("Загрузка нормативов...", Прогресс, "",) ;
	Прогресс=2;
	
	Общ=МассивСекций.Количество()+2;
	СчЭл=2;
	Для Каждого Эл Из МассивСекций Цикл
		Нормы		= СметнаяКомпонента.ОбновитьПоБазе("","",Эл.СметноНормативнаяБаза,"","","",Эл.Сборник,Эл.Секция,Ложь);
		ДобавитьВетку(Эл,Нормы);
		СчЭл=СчЭл+1;
		Прогресс=Цел(СчЭл*100/Общ);
		Состояние("Загрузка нормативов...", Прогресс, "",) ;
		ОбработкаПрерыванияПользователя();
	КонецЦикла;

    ВыключитьЗагрузку(НСтр("ru='Загрузка завершена. Загружено нормативов: "+Строка(ЗагруженоНормативов)+"'"));

КонецПроцедуры          


&НаКлиенте
Процедура ЗагрузитьТекущийУзел(Команда)
	
	Если Элементы.ДеревоНормативов.ТекущиеДанные=Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать узел для загрузки");
		Возврат;
	КонецЕсли;
	ТолькоТекущийУзел=Истина;
	ТекущийНомерДляЗагрузки=Элементы.ДеревоНормативов.ТекущиеДанные.Номер;
	ВключитьЗагрузку();
	
	МассивСекций=Новый Массив;
	ПолучитьМассивСекций(МассивСекций);
	
	Общ=МассивСекций.Количество()+2;
	СчЭл=2;
	
	Для Каждого Эл Из МассивСекций Цикл
		Нормы		= СметнаяКомпонента.ОбновитьПоБазе("","",Эл.СметноНормативнаяБаза,"","","",Эл.Сборник,Эл.Секция,Ложь);
		ДобавитьВетку(Эл,Нормы);
		СчЭл=СчЭл+1;
		Прогресс=Цел(СчЭл*100/Общ);
		Состояние("Загрузка нормативов...", Прогресс, "",) ;
	КонецЦикла;

    ВыключитьЗагрузку(НСтр("ru='Загрузка завершена. Загружено нормативов: "+Строка(ЗагруженоНормативов)+"'"));

	
КонецПроцедуры


&НаКлиенте
Процедура ВключитьЗагрузку()
	
	Если Элементы.ДеревоНормативов.ТекущиеДанные<>Неопределено Тогда
		ТекущийНомер=Элементы.ДеревоНормативов.ТекущиеДанные.Номер;
	КонецЕсли;
	ЗагруженоНормативов=0;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьЗагрузку(Текст)
	
	ПрочитатьДерево();
	МассивДляРазворота=Новый Массив;
	ЗаполнитьМассивДляРазворота(МассивДляРазворота);
	Сч=МассивДляРазворота.Количество()-1;
	РазвернутьНС(ДеревоНормативов,Сч,МассивДляРазворота);

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьМассивСекций(МассивСекций)
	
	
	ДЗ=ДанныеФормыВЗначение(ДеревоНормативов, Тип("ДеревоЗначений"));
	Если Счетчик=0 Тогда
		Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("ЭтоИерархия",Ложь),Истина);
		Макс=0;
		Для Каждого Эл Из Строки Цикл
			Если Эл.Номер>Макс Тогда
				Макс=Эл.Номер;
			КонецЕсли;
		КонецЦикла;
		Если Макс=0 Тогда
			Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("ЭтоИерархия",Истина),Истина);
			Для Каждого Эл Из Строки Цикл
				Если Эл.Номер>Макс Тогда
					Макс=Эл.Номер;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Счетчик=Макс+1;
	КонецЕсли;
	
	Если Не ТолькоТекущийУзел Тогда
		Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("ЭтоНижнийУровень,Загружен",Истина,Ложь),Истина);
	Иначе
		Стр0 = ДЗ.Строки.НайтиСтроки(Новый Структура("Номер",ТекущийНомерДляЗагрузки),Истина);
		Если Стр0.Количество()>0 Тогда
			ДЗ0=Стр0[0];
			Если ДЗ0.ЭтоНижнийУровень=Истина  И  ДЗ0.Загружен=Ложь Тогда
				Строки=Новый Массив;
				Строки.Добавить(Стр0[0]);
			Иначе
				Строки = ДЗ0.Строки.НайтиСтроки(Новый Структура("ЭтоНижнийУровень,Загружен",Истина,Ложь),Истина);
			КонецЕсли;
			
		Иначе 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	Для Каждого Эл Из Строки Цикл
		
		Родитель=Эл;
		Сборник=0;
		Пока Родитель<>Неопределено Цикл
			Если Родитель.Секция="" или Родитель.Секция="0"  Тогда
				Сборник=Число(Родитель.Ид);
				Прервать;
			КонецЕсли;
			Родитель=Родитель.Родитель;
		КонецЦикла;
		
		МассивСекций.Добавить(Новый Структура("Секция,Номер,СметноНормативнаяБаза,Сборник",Число(Эл.Секция),Эл.Номер,Эл.СметноНормативнаяБаза,Сборник));
	КонецЦикла;

	
КонецПроцедуры


&НаСервере
Процедура СоздатьСборники(Нормы)
	
	Если Найти(Нормы,"Part")=0 Тогда 
		Возврат; 
	КонецЕсли;
	
	
	ЧтениеСхемыXML = Новый ЧтениеXML;
	ЧтениеСхемыXML.УстановитьСтроку(Нормы);
	ОбъектXDTO=ФабрикаXDTO.ПрочитатьXML(ЧтениеСхемыXML).Part;
	
	ДЗ=ДанныеФормыВЗначение(ДеревоНормативов, Тип("ДеревоЗначений"));
	ДЗ.Строки.Очистить();
	
	Корень=Неопределено; Ид=""; Секция="NormPartSection";
	Сч=1;
	
	
	Для Каждого Эл Из  ОбъектXDTO Цикл
		Ст=Новый Структура("Name,Code","","","");
		ЗаполнитьЗначенияСвойств(Ст,Эл);
		
		
		ИдРодителя=Эл.ParentId;
		Если  Эл.SectionId<>"0" и Эл.ParentId="0"  Тогда
			ИдРодителя=Эл.PartId;
		КонецЕсли;	
		
		Если Ид<>ИдРодителя или Секция<>Эл.Type Тогда
			Если   Эл.SectionId<>"0" и Эл.ParentId<>"0" Тогда
				Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("Секция", Эл.ParentId),Истина);
			Иначе
				Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("Ид,Секция", ИдРодителя,"0"),Истина);
			КонецЕсли;
			Если Строки.Количество()>0 Тогда
				СтрокаДерева=Строки[0].Строки.Добавить(); 
				Корень=Строки[0];
				Корень.ЭтоНижнийУровень=Ложь;
			Иначе
				СтрокаДерева=ДЗ.Строки.Добавить(); 
				Корень=ДЗ;
			КонецЕсли;
		Иначе
			СтрокаДерева=Корень.Строки.Добавить();
			Корень.ЭтоНижнийУровень=Ложь;
		КонецЕсли;
		Ид=ИдРодителя;
		Секция=Эл.Type;
		
		СтрокаДерева.Ид=Эл.Id;
		СтрокаДерева.Наименование=Ст.Name;
		СтрокаДерева.Код=Ст.Code;
		СтрокаДерева.Секция=Эл.SectionId;
		
		
		СтрокаДерева.Номер=Сч;
		СтрокаДерева.ЭтоИерархия=Истина;
		СтрокаДерева.ЭтоНижнийУровень=Истина;
		СтрокаДерева.Загружен=Ложь;
		
		Сч=Сч+1;	
	КонецЦикла;  	
	
	Счетчик=Сч;
	
	Зп=РегистрыСведений.СМ_ДополнительныеНастройки.СоздатьМенеджерЗаписи();
	Зп.ИдентификаторНастройки="ДеревоНормативов";
	Зп.Настройки=Новый ХранилищеЗначения(ДЗ);
	Зп.Записать();
	
	ЗначениеВДанныеФормы(ДЗ,ДеревоНормативов);
	
КонецПроцедуры



&НаСервере
Процедура ДобавитьВетку(НомерСекция,Нормы)
	
	Зп=РегистрыСВедений.СМ_ДополнительныеНастройки.СоздатьМенеджерЗаписи();
	Зп.ИдентификаторНастройки="ДеревоНормативов";
	Зп.Прочитать();
	ДЗ=Зп.Настройки.Получить();

	Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("Номер",НомерСекция.Номер),Истина);
	
	ЧтениеСхемыXML = Новый ЧтениеXML;
	ЧтениеСхемыXML.УстановитьСтроку(Нормы);
	Если Найти(Нормы,"Norm")=0 Тогда 
		Строки[0].Загружен=Истина;
		Возврат; 
	КонецЕсли;
	ОбъектXDTO=ФабрикаXDTO.ПрочитатьXML(ЧтениеСхемыXML).Norm;
	
	
	СтруктураДляПроверки=Новый Структура("Code","");
	ЗаполнитьЗначенияСвойств(СтруктураДляПроверки,ОбъектXDTO);
	
	Если СтруктураДляПроверки.Code<>"" Тогда 
		
		Событие = НСтр("ru = 'Принят норматив из ВНБ "+ОбъектXDTO.Code+" "+ОбъектXDTO.Name+"'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие); 
			
		СтрокиНижнегоУровня = Строки[0].Строки.Добавить();
		СтрокиНижнегоУровня.Наименование=ОбъектXDTO.Name;
		Попытка
			СтрокиНижнегоУровня.ЕдиницаИзмерения=ОбъектXDTO.Izm;
		Исключение
			СтрокиНижнегоУровня.ЕдиницаИзмерения=СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСметномуКоду(ОбъектXDTO.Unit);
		КонецПопытки;
		СтрокиНижнегоУровня.Код=ОбъектXDTO.Code;
		СтрокиНижнегоУровня.Номер=Счетчик;
		СтрокиНижнегоУровня.Секция=НомерСекция.Секция;
		СтрокиНижнегоУровня.ТипНормативногоСборника=СМ_СметаЗагрузкаВызовСервера.ОпределитьТипНормСборникаПоКоду(ОбъектXDTO.NormTypeCode);
		СтрокиНижнегоУровня.СметноНормативнаяБаза =ОбъектXDTO.DbId;
		
		Счетчик=Счетчик+1;
		ЗагруженоНормативов=ЗагруженоНормативов+1;
		
	Иначе
		Для Каждого Эл Из ОбъектXDTO Цикл
			
			Событие = НСтр("ru = 'Принят норматив из ВНБ "+Эл.Code+" "+Эл.Name+"'");
			СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие); 
			
			СтрокиНижнегоУровня = Строки[0].Строки.Добавить();
			СтрокиНижнегоУровня.Наименование=Эл.Name;
			Попытка
				СтрокиНижнегоУровня.ЕдиницаИзмерения=Эл.Izm;
			Исключение
				СтрокиНижнегоУровня.ЕдиницаИзмерения=СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСметномуКоду(Эл.Unit);
			КонецПопытки;
			СтрокиНижнегоУровня.Код=Эл.Code;
			СтрокиНижнегоУровня.Номер=Счетчик;
			СтрокиНижнегоУровня.Секция=НомерСекция.Секция;
			СтрокиНижнегоУровня.ТипНормативногоСборника=СМ_СметаЗагрузкаВызовСервера.ОпределитьТипНормСборникаПоКоду(Эл.NormTypeCode);
			СтрокиНижнегоУровня.СметноНормативнаяБаза =Эл.DbId;
			ЗагруженоНормативов=ЗагруженоНормативов+1;
			Счетчик=Счетчик+1;
		КонецЦикла;
	КонецЕсли;
	
	Строки[0].Загружен=Истина;
	
	Зп=РегистрыСведений.СМ_ДополнительныеНастройки.СоздатьМенеджерЗаписи();
	Зп.ИдентификаторНастройки="ДеревоНормативов";
	Зп.Настройки=Новый ХранилищеЗначения(ДЗ);
	Зп.Записать();

	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДерево()
	
	Зп=РегистрыСВедений.СМ_ДополнительныеНастройки.СоздатьМенеджерЗаписи();
	Зп.ИдентификаторНастройки="ДеревоНормативов";
	Зп.Прочитать();
	ДЗ=Зп.Настройки.Получить();
	
	ЗначениеВДанныеФормы(ДЗ,ДеревоНормативов);
	КоличествоСопоставленных();

	
КонецПроцедуры

&НаСервере
Процедура КоличествоСопоставленных(МассивДляРазворота=Неопределено)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СМ_АналогиОбъектовВНБ.ШифрАналога,
	                    |	СМ_АналогиОбъектовВНБ.ТипНормативногоСборникаАналога,
	                    |	СМ_АналогиОбъектовВНБ.СметноНормативнаяБаза,
	                    |	КОЛИЧЕСТВО(СМ_АналогиОбъектовВНБ.ШифрОбъекта) КАК Количество,
	                    |	КОЛИЧЕСТВО(СМ_АналогиОбъектовВНБ.ТипНормативногоСборникаОбъекта) КАК ТипНормативногоСборникаОбъекта
	                    |ИЗ
	                    |	РегистрСведений.СМ_АналогиОбъектовВНБ КАК СМ_АналогиОбъектовВНБ
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	СМ_АналогиОбъектовВНБ.ШифрАналога,
	                    |	СМ_АналогиОбъектовВНБ.ТипНормативногоСборникаАналога,
	                    |	СМ_АналогиОбъектовВНБ.СметноНормативнаяБаза");
	Рез=Запрос.Выполнить().Выбрать();
	ДЗ=ДанныеФормыВЗначение(ДеревоНормативов, Тип("ДеревоЗначений"));
	
	Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("ЭтоИерархия",Ложь),Истина);
	Для Каждого Эл Из Строки Цикл
		Эл.КоличествоСопоставленных=0;
	КонецЦикла;            
	
	Пока Рез.Следующий() Цикл
		Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("ЭтоИерархия,Код,ТипНормативногоСборника,СметноНормативнаяБаза",Ложь,Рез.ШифрАналога,Рез.ТипНормативногоСборникаАналога,Рез.СметноНормативнаяБаза),Истина);
		Для Каждого Эл Из Строки Цикл
			Эл.КоличествоСопоставленных=Рез.Количество;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(ДЗ,ДеревоНормативов);
	
	Если  МассивДляРазворота<>Неопределено Тогда
		Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("Номер",ТекущийНомер),Истина);
		Если Строки.Количество()>0 Тогда
			МассивДляРазворота.Очистить();
			МассивДляРазворота.Добавить(ТекущийНомер);
			Родитель=Строки[0].Родитель;
			Пока Родитель<>Неопределено Цикл
				МассивДляРазворота.Добавить(Родитель.Номер);
				Родитель=Родитель.Родитель;
			КонецЦикла;
			          			
		КонецЕсли;	
	КонецЕсли;	    	
	
КонецПроцедуры


&НаСервере
Процедура СопоставленоТекущему(Шифр, Тип)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СМ_АналогиОбъектовВНБ.ШифрАналога КАК Код,
	|	СМ_АналогиОбъектовВНБ.ТипНормативногоСборникаАналога КАК ТипНормативногоСборника,
	|	СМ_АналогиОбъектовВНБ.СметноНормативнаяБаза
	|ИЗ
	|	РегистрСведений.СМ_АналогиОбъектовВНБ КАК СМ_АналогиОбъектовВНБ
	|ГДЕ
	|	СМ_АналогиОбъектовВНБ.ШифрОбъекта = &Шифр
	|	И СМ_АналогиОбъектовВНБ.ТипНормативногоСборникаОбъекта = &Тип");
	Запрос.УстановитьПараметр("Шифр",Шифр);
	Запрос.УстановитьПараметр("Тип",Тип);
	Аналоги.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивДляРазворота(МассивДляРазворота)
	
	ДЗ=ДанныеФормыВЗначение(ДеревоНормативов, Тип("ДеревоЗначений"));
	
	Если  МассивДляРазворота<>Неопределено Тогда
		Строки = ДЗ.Строки.НайтиСтроки(Новый Структура("Номер",ТекущийНомер),Истина);
		Если Строки.Количество()>0 Тогда
			МассивДляРазворота.Очистить();
			МассивДляРазворота.Добавить(ТекущийНомер);
			Родитель=Строки[0].Родитель;
			Пока Родитель<>Неопределено Цикл
				МассивДляРазворота.Добавить(Родитель.Номер);
				Родитель=Родитель.Родитель;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура РазвернутьНС(Узел,Сч,МассивДляРазворота)
	
	Если Сч<0 Тогда Возврат; КонецЕсли;
	
	
	ЭлементыДерева = Узел.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если  ЭлементДерева.Номер=МассивДляРазворота[Сч] Тогда
			Элементы.ДеревоНормативов.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
			Если Сч=0 Тогда
				Элементы.ДеревоНормативов.ТекущаяСтрока=ЭлементДерева.ПолучитьИдентификатор();
			КонецЕсли;
			Сч=Сч-1;
			РазвернутьНС(ЭлементДерева,Сч,МассивДляРазворота);
			Если Сч<0 Тогда Возврат; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	
	ЭлементыДерева = ДеревоНормативов.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		Элементы.ДеревоНормативов.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Истина);
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	//папки с задачами
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(226,245,201));
	Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	
		ГруппаОтбораИли = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ГруппаОтбораИли.Использование = Истина;

	Для Каждого Эл Из Аналоги Цикл
		ГруппаОтбора = ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаОтбора.Использование = Истина;
		
		ЭлементУсловия                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.Код");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Эл.Код;	//Истина;
		ЭлементУсловия.Использование  = Истина;
		
		ЭлементУсловия                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.ТипНормативногоСборника");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Эл.ТипНормативногоСборника;	//Истина;
		ЭлементУсловия.Использование  = Истина;
		
		ЭлементУсловия                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.СметноНормативнаяБаза");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Эл.СметноНормативнаяБаза;	//Истина;
		ЭлементУсловия.Использование  = Истина;
	КонецЦикла;

	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.КоличествоСопоставленных");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение = 0;
	ЭлементУсловия.Использование  = Истина;
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(211, 211, 211));
	Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.Загружен");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	ЭлементУсловия.Использование  = Истина;
	
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.ЭтоНижнийУровень");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	
	Если Элементы.ДеревоНормативовСкрытьСопоставленные1.Пометка Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.КоличествоСопоставленных");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементУсловия.ПравоеЗначение = 0;
		ЭлементУсловия.Использование  = Истина;
	КонецЕсли;
	
	Если Элементы.ДеревоНормативовСкрытьНесопоставленные1.Пометка Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.КоличествоСопоставленных");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = 0;
		ЭлементУсловия.Использование  = Истина;
	КонецЕсли;
	
	Если Элементы.ДеревоНормативовПоказатьАналогиВКаталоге.Пометка Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.Сопоставлено");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементУсловия.ПравоеЗначение = Истина;
		ЭлементУсловия.Использование  = Истина;
		
	КонецЕсли;
	
	Если Элементы.ДеревоНормативовДеревоНормативовСписок.Пометка или СтрДлина(Поиск)>=3 или Элементы.ДеревоНормативовПоказатьАналогиВКаталоге.Пометка Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.ЭтоИерархия");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Истина;
		ЭлементУсловия.Использование  = Истина;
	КонецЕсли;
	
	Если СтрДлина(Поиск)>=3 Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНормативов.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНормативов.Код");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеСодержит;
		ЭлементУсловия.ПравоеЗначение = Поиск;
		ЭлементУсловия.Использование  = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСопоставленные1(Команда)
	РазвернутьДерево();
	Элементы.ДеревоНормативовСкрытьНесопоставленные1.Пометка=Ложь;
	Элементы.ДеревоНормативовСкрытьСопоставленные1.Пометка=не  Элементы.ДеревоНормативовСкрытьСопоставленные1.Пометка;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНесопоставленные1(Команда)
	РазвернутьДерево();
	Элементы.ДеревоНормативовСкрытьСопоставленные1.Пометка=Ложь;
	Элементы.ДеревоНормативовСкрытьНесопоставленные1.Пометка=не  Элементы.ДеревоНормативовСкрытьНесопоставленные1.Пометка;
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАналогиВКаталоге(Команда)
	РазвернутьДерево();
	Элементы.ДеревоНормативовПоказатьАналогиВКаталоге.Пометка=не  Элементы.ДеревоНормативовПоказатьАналогиВКаталоге.Пометка;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНормативовСписок(Команда)
	РазвернутьДерево();
	Элементы.ДеревоНормативовДеревоНормативовДерево.Пометка=Ложь;
	Элементы.ДеревоНормативовДеревоНормативовСписок.Пометка=Не  Элементы.ДеревоНормативовДеревоНормативовСписок.Пометка;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНормативовДерево(Команда)
	РазвернутьДерево();
	Элементы.ДеревоНормативовДеревоНормативовСписок.Пометка=Ложь;
	Элементы.ДеревоНормативовДеревоНормативовДерево.Пометка=Не  Элементы.ДеревоНормативовДеревоНормативовДерево.Пометка;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	РазвернутьДерево();
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНормативВБазе(Команда)
	Если  СметнаяКомпонента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДанные=Элементы.ДеревоНормативов.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выделите строку норматива", Ложь);
		Возврат;
	КонецЕсли;
	ИдФормы		= СметнаяКомпонента.ПоказатьОкноНорм("", ТекДанные.СметноНормативнаяБаза, СМ_СметаЗагрузкаВызовСервера.ОпределитьКодТипаСборника(ТекДанные.ТипНормативногоСборника), ТекДанные.Код, Ложь, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Сравнить(Команда)
	
	МассивОбъектов=Новый Массив;
	Для Каждого Эл Из   Элементы.НормативныеСборники.ВыделенныеСтроки Цикл
		МассивОбъектов.Добавить(Эл);
	КонецЦикла;
	
	МассивНорм=Новый Массив;
	Для Каждого Эл Из   Элементы.ДеревоНормативов.ВыделенныеСтроки Цикл
		ОбъектДляЗаполнения=ДеревоНормативов.НайтиПоИдентификатору(Эл);
		Нормы		= СметнаяКомпонента.ОбновитьПоБазе(ОбъектДляЗаполнения.Код,"",ОбъектДляЗаполнения.СметноНормативнаяБаза,СМ_СметаЗагрузкаВызовСервера.ОпределитьКодТипаСборника(ОбъектДляЗаполнения.ТипНормативногоСборника),"","",0,Число(ОбъектДляЗаполнения.Секция),Истина);
		МассивНорм.Добавить(Нормы);
	КонецЦикла;

	ОтчетПоСравнению(МассивОбъектов,МассивНорм).Показать();
	
КонецПроцедуры


&НаСервере

Функция ОтчетПоСравнению(МассивОбъектов,МассивНорм)
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерСравнения",ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТЗ.Колонки.Добавить("Порядок",ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТЗ.Колонки.Добавить("Таблица",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("НомерСтроки",ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТЗ.Колонки.Добавить("Код",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("Наименование",ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТЗ.Колонки.Добавить("ЕдиницаИзмерения",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("Норма",ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	ТЗ.Колонки.Добавить("КодБазы",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("НаименованиеБазы",ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТЗ.Колонки.Добавить("ЕдиницаИзмеренияБазы",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("НормаБазы",ОбщегоНазначения.ОписаниеТипаЧисло(15,4));

	
	
    

	Сч1=0;
	Для Каждого Эл Из МассивОбъектов Цикл

		Для Каждого ТекНорма Из МассивНорм Цикл
			Если Найти(ТекНорма,"Norm")=0 Тогда 
				Продолжить;
			КонецЕсли;
			Сч1=Сч1+1;
			ЧтениеСхемыXML = Новый ЧтениеXML;
			ЧтениеСхемыXML.УстановитьСтроку(ТекНорма);
			ОбъектXDTO=ФабрикаXDTO.ПрочитатьXML(ЧтениеСхемыXML).Norm;
			СтруктураДляПроверки=Новый Структура("Code","");
			ЗаполнитьЗначенияСвойств(СтруктураДляПроверки,ОбъектXDTO);
			Если СтруктураДляПроверки.Code<>"" Тогда 
				ДобавитьСтрокуТаблицы(ТЗ,Эл,ОбъектXDTO,Сч1);
			Иначе
				Для Каждого ЭлементXDTO Из ОбъектXDTO Цикл
					ДобавитьСтрокуТаблицы(ТЗ,Эл,ЭлементXDTO,Сч1);
					Сч1=Сч1+1;
				КонецЦикла;
			КонецЕсли;
			
			
		КонецЦикла;
	КонецЦикла;
	
	СхемаКомпоновкиДанных=РегистрыСведений.СМ_АналогиОбъектовВНБ.ПолучитьМакет("СхемаКомпоновкиДанных");

	
	НастройкиСКД  = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ВТ",ТЗ);
	
	Результат=Новый ТабличныйДокумент;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных ,ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
	
	Результат.ОтображатьСетку=Ложь;
	Результат.ОтображатьЗаголовки=Ложь;
	
	
	Возврат Результат;

	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуТаблицы(ТЗ,Норматив,Норма,Сч1)
	
	Стр=ТЗ.Добавить();
	Стр.НомерСравнения=Сч1;
	Стр.Порядок=1;
	Стр.НомерСтроки=1;
	Стр.Таблица="Расценка";
	Стр.Код=Норматив.КодНормативнойРасценки;
	Стр.КодБазы=Норма.Code;
	Стр.Наименование=Норматив.Наименование;
	Стр.НаименованиеБазы=Норма.Name;
	Стр.ЕдиницаИзмерения=Строка(Норматив.ЕдиницаИзмерения);
	Стр.ЕдиницаИзмеренияБазы=Норма.Izm;


	
	ТЗ2=Новый ТаблицаЗначений;
	ТЗ2.Колонки.Добавить("НомерСтроки",ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТЗ2.Колонки.Добавить("Код",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ2.Колонки.Добавить("Наименование",ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТЗ2.Колонки.Добавить("ЕдиницаИзмерения",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ2.Колонки.Добавить("НормаРасхода",ОбщегоНазначения.ОписаниеТипаЧисло(15,4));

	
	                //РесурсыНормативныхСборников
	Инд=1;
	Для Каждого Эл Из Норма.Resources.Resource  Цикл
		Стр2=ТЗ2.Добавить();
		Стр2.НомерСтроки=Инд;
		Стр2.Код=Эл.code;
		Стр2.Наименование=Эл.name;
		Стр2.ЕдиницаИзмерения=Эл.unitname;
		Стр2.НормаРасхода=Эл.Rate;
		Инд=Инд+1;
	КонецЦикла;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ТЗ.НомерСтроки,
	                    |	ТЗ.Код,
	                    |	ТЗ.Наименование,
	                    |	ТЗ.ЕдиницаИзмерения,
	                    |	ТЗ.НормаРасхода
	                    |ПОМЕСТИТЬ ВТ
	                    |ИЗ
	                    |	&ТЗ КАК ТЗ
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВЫБОР
	                    |		КОГДА СМ_НормативныеСборникиРесурсыНормативныхСборников.НомерСтроки ЕСТЬ NULL
	                    |			ТОГДА ВТ.НомерСтроки
	                    |		ИНАЧЕ СМ_НормативныеСборникиРесурсыНормативныхСборников.НомерСтроки
	                    |	КОНЕЦ КАК НомерСтроки,
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.НормаРасхода КАК Норма,
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.ТипРесурса,
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.Код КАК Код,
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.Наименование КАК Наименование,
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ресурс.ВидРесурса КАК ВидРесурса,
	                    |	ВТ.НомерСтроки КАК НомерСтроки1,
	                    |	ВТ.Код КАК КодБазы,
	                    |	ВТ.Наименование КАК НаименованиеБазы,
	                    |	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмеренияБазы,
	                    |	ВТ.НормаРасхода КАК НормаБазы
	                    |ИЗ
	                    |	Справочник.СМ_НормативныеСборники.РесурсыНормативныхСборников КАК СМ_НормативныеСборникиРесурсыНормативныхСборников
	                    |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	                    |		ПО СМ_НормативныеСборникиРесурсыНормативныхСборников.НомерСтроки = ВТ.НомерСтроки
	                    |ГДЕ
	                    |	СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка = &Ссылка
	                    |	И ВЫБОР
	                    |			КОГДА &ИспользоватьСтатусы
	                    |				ТОГДА СМ_НормативныеСборникиРесурсыНормативныхСборников.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СМ_СтатусыФормированияНормативов.Утвержден)
	                    |			ИНАЧЕ ИСТИНА
	                    |		КОНЕЦ");
	
        Запрос.УстановитьПараметр("Ссылка",Норматив);
		Запрос.УстановитьПараметр("ТЗ",ТЗ2);
		Запрос.УстановитьПараметр("ИспользоватьСтатусы",ПолучитьФункциональнуюОпцию("СМ_ИспользоватьСтатусыНормативов"));
		Рез=Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			
			Стр=ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Рез);
			Стр.НомерСравнения=Сч1;
			Стр.Порядок=2;
			Стр.НомерСтроки=Рез.НомерСтроки;
			Стр.Таблица="Ресурсы";
			
		КонецЦикла;
		

	ТЗ3=Новый ТаблицаЗначений;
	ТЗ3.Колонки.Добавить("НомерСтроки",ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТЗ3.Колонки.Добавить("Наименование",ОбщегоНазначения.ОписаниеТипаСтрока(500));
	Инд=1;
	Для Каждого Эл Из Норма.Works.Work  Цикл
		Стр2=ТЗ3.Добавить();
		Стр2.НомерСтроки=Инд;
		Стр2.Наименование=Эл.Description;
		Инд=Инд+1;
	КонецЦикла;

	Запрос.Текст="ВЫБРАТЬ
	             |	ТЗ.НомерСтроки,
	             |	ТЗ.Наименование
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&ТЗ КАК ТЗ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СМ_НормативныеСборникиСоставРабот.НомерСтроки КАК Код,
	             |	СМ_НормативныеСборникиСоставРабот.НаименованиеРаботы КАК Наименование,
	             |	СМ_НормативныеСборникиСоставРабот.Номер,
	             |	ВТ.НомерСтроки КАК КодБазы,
	             |	ВТ.Наименование КАК НаименованиеБазы
	             |ИЗ
	             |	Справочник.СМ_НормативныеСборники.СоставРабот КАК СМ_НормативныеСборникиСоставРабот
	             |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	             |		ПО СМ_НормативныеСборникиСоставРабот.НомерСтроки = ВТ.НомерСтроки
	             |ГДЕ
	             |	СМ_НормативныеСборникиСоставРабот.Ссылка = &Ссылка
	             |	И ВЫБОР
	             |			КОГДА &ИспользоватьСтатусы
	             |				ТОГДА СМ_НормативныеСборникиСоставРабот.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СМ_СтатусыФормированияНормативов.Утвержден)
	             |			ИНАЧЕ ИСТИНА
	             |		КОНЕЦ";

      Запрос.УстановитьПараметр("ТЗ",ТЗ3);
	Запрос.УстановитьПараметр("ИспользоватьСтатусы",ПолучитьФункциональнуюОпцию("СМ_ИспользоватьСтатусыНормативов"));	
		Рез=Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			Стр=ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Рез);
			Стр.НомерСравнения=Сч1;
			Стр.Порядок=3;
			Стр.Таблица="Работы";
		КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура Свернуть(Команда)
	Элементы.ГруппаПраво.Видимость=Не Элементы.ГруппаПраво.Видимость;
КонецПроцедуры
